Repository: Technoka/production_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

source: Selected photos
es: Fotos seleccionadas

source: Uploading
es: Subiendo

source: Upload error
es: Error al subir

# multiApprovalRequired
source: Multiple Approval Required
es: Aprobación Múltiple Requerida

# minApprovalsRequired
source: Minimum approvals required
es: Mínimo de aprobaciones requeridas

# approversSelected
source: selected
es: seleccionados

source: No eligible approvers
es: No hay aprobadores elegibles

source: Unknown role
es: Rol desconocido

# noTransitionConfigured
source: No transition configured between these statuses
es: No hay transición configurada entre estos estados

# transitionNotActive
source: This transition is deactivated
es: Esta transición está desactivada

# roleNotAuthorized
source: Your role is not authorized for this transition
es: Tu rol no está autorizado para esta transición

source: Custom parameters
es: Parámetros personalizados

source: Add parameter
es: Añadir parámetro

source: Remove parameter
es: Quitar parámetro

source: Number
es: Número

# booleanType
source: Yes/No
es: Si/No
