Repository: Technoka/production_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# appName
source: Marsot Production
es: Production Tracker

source: Welcome
es: Bienvenido

source: Yes
es: Sí

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

source: Edit
es: Editar

source: Create
es: Crear

source: Update
es: Actualizar

source: Search
es: Buscar

source: Filter
es: Filtrar

source: Loading...
es: Cargando...

source: Success
es: Éxito

source: Confirm
es: Confirmar

source: Back
es: Atrás

source: Next
es: Siguiente

source: Finish
es: Finalizar

source: Close
es: Cerrar

source: Select
es: Seleccionar

source: Select All
es: Seleccionar Todo

source: Clear
es: Limpiar

source: Apply
es: Aplicar

source: Home
es: Inicio

source: Projects
es: Proyectos

source: Production
es: Producción

source: Clients
es: Clientes

source: Catalog
es: Catálogo

source: Settings
es: Configuración

source: Profile
es: Perfil

source: Logout
es: Cerrar Sesión

source: Login
es: Iniciar Sesión

source: Register
es: Registrarse

source: Email
es: Correo Electrónico

source: Password
es: Contraseña

source: Confirm Password
es: Confirmar Contraseña

source: Forgot Password?
es: ¿Olvidaste tu contraseña?

source: Reset Password
es: Restablecer Contraseña

source: Name
es: Nombre

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes cuenta? Inicia sesión

# dontHaveAccount
source: Don't have an account?
es: ¿No tienes una cuenta?

source: Organization
es: Organización

source: Organizations
es: Organizaciones

source: Create Organization
es: Crear Organización

source: Organization Name
es: Nombre de la Organización

source: Organization Settings
es: Configuración de Organización

source: Members
es: Miembros

source: Invite Members
es: Invitar Miembros

source: Project
es: Proyecto

source: Project Name
es: Nombre del Proyecto

source: Create Project
es: Crear Proyecto

source: Edit Project
es: Editar Proyecto

source: Project Details
es: Detalles del Proyecto

source: Client
es: Cliente

source: Status
es: Estado

source: Delivery Date
es: Fecha de Entrega

source: Estimated Delivery Date
es: Fecha Estimada de Entrega

source: Actual Delivery Date
es: Fecha Real de Entrega

source: Description
es: Descripción

source: Priority
es: Prioridad

source: Assigned Members
es: Miembros Asignados

source: Products
es: Productos

source: Product
es: Producto

source: Product name
es: Nombre del producto

source: Quantity
es: Cantidad

source: Unit Price
es: Precio Unitario

source: Total Price
es: Precio Total

source: Reference
es: Referencia

source: Customization
es: Personalización

source: Notes
es: Notas

source: Phases
es: Fases

source: Phase
es: Fase

source: Phase Progress
es: Progreso de Fase

source: Current Phase
es: Fase Actual

source: Start Phase
es: Iniciar Fase

source: Complete Phase
es: Completar Fase

source: Phase Name
es: Nombre de la Fase

source: Phase Order
es: Orden de Fase

source: Production Batch
es: Lote de Producción

source: Batches
es: Lotes

source: Create Batch
es: Crear Lote

source: Batch Name
es: Nombre del Lote

source: In Production
es: En Producción

source: Completed
es: Completado

source: Pending
es: Pendiente

source: Client Name
es: Nombre del Cliente

source: Create Client
es: Crear Cliente

source: Edit Client
es: Editar Cliente

source: Company
es: Empresa

source: Phone
es: Teléfono

source: Address
es: Dirección

# mustBelongToOrganization
source: You must belong to an organization
es: Debes pertenecer a una organización

source: New Client
es: Nuevo cliente

# searchClientsHint
source: Search clients...
es: Buscar clientes...

source: No clients registered
es: No hay clientes registrados

source: No clients found
es: No se han encontrado clientes

source: Error loading clients
es: Error al cargar clientes

# tapToAddClient
source: Tap the + button to add one
es: Toca el botón + para agregar uno

source: No results found
es: No se encontraron resultados

# forSearch
source: for
es: para

source: Visual Settings
es: Configuración Visual

source: Branding Settings
es: Configuración de Marca

source: Language Settings
es: Configuración de Idioma

source: Primary Color
es: Color Primario

source: Secondary Color
es: Color Secundario

source: Accent Color
es: Color de Acento

source: Upload Logo
es: Subir Logo

source: Change Logo
es: Cambiar Logo

source: Remove Logo
es: Eliminar Logo

source: Font Family
es: Tipografía

source: Welcome Message
es: Mensaje de Bienvenida

source: Language
es: Idioma

source: Default Language
es: Idioma por Defecto

source: Supported Languages
es: Idiomas Soportados

source: Use System Language
es: Usar Idioma del Sistema

source: Select Language
es: Seleccionar Idioma

source: Spanish
es: Español

source: English
es: Inglés

source: Preview
es: Vista Previa

source: Apply Changes
es: Aplicar Cambios

source: Reset to Default
es: Restaurar Valores por Defecto

source: Notifications
es: Notificaciones

source: Email Notifications
es: Notificaciones por Email

source: Push Notifications
es: Notificaciones Push

source: Notification Preferences
es: Preferencias de Notificación

# settingsSaved
source: Settings saved successfully
es: Configuración guardada correctamente

# settingsError
source: Error saving settings
es: Error al guardar la configuración

# logoUploaded
source: Logo uploaded successfully
es: Logo subido correctamente

# logoUploadError
source: Error uploading logo
es: Error al subir el logo

# logoRemoved
source: Logo removed successfully
es: Logo eliminado correctamente

# confirmRemoveLogo
source: Are you sure you want to remove the logo?
es: ¿Estás seguro de que quieres eliminar el logo?

# confirmResetSettings
source: Are you sure you want to reset to default settings?
es: ¿Estás seguro de que quieres restaurar los valores por defecto?

# noPermission
source: You don't have permission to perform this action
es: No tienes permisos para realizar esta acción

# adminOnly
source: Only administrators can access this section
es: Solo los administradores pueden acceder a esta sección

# fieldRequired
source: This field is required
es: Este campo es obligatorio

# invalidEmail
source: Invalid email address
es: Dirección de correo inválida

# passwordTooShort
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

source: Passwords don't match
es: Las contraseñas no coinciden

# invalidColor
source: Invalid color format
es: Formato de color inválido

# createdLabel
source: Created:
es: Creado:

# updatedLabel
source: Updated:
es: Actualizado:

# noProductsInProject
source: No products in this project
es: No hay productos en este proyecto

# batchLabel
source: Batch:
es: Lote:

source: Quantity label
es: Etiqueta de cantidad

# clientDetailTitle
source: Client Detail
es: Detalle del Cliente

# contactInfoSection
source: Contact Information
es: Información de Contacto

# cityZipLabel
source: City / Zip Code
es: Ciudad / C.P.

# countryLabel
source: Country
es: País

# notesSection
source: Notes
es: Notas

# registrationInfoSection
source: Registration Information
es: Información del Registro

# creationDateLabel
source: Creation Date
es: Fecha de creación

# lastUpdateLabel
source: Last Update
es: Última actualización

source: Copied to clipboard
es: Copiado al portapapeles

# cantDeleteClientError
source: Cannot delete client. Organization not found.
es: No se puede eliminar el cliente. Organización no encontrada.

# deleteClientTitle
source: Delete Client
es: Eliminar Cliente

# deleteClientConfirm
source: Are you sure you want to delete this client? This action cannot be undone.
es: Esta acción no se puede deshacer. ¿Estás seguro?

source: Client deleted
es: Cliente eliminado

# deleteClientError
source: Error deleting client
es: Error al eliminar cliente

# newClientTitle
source: New Client
es: Nuevo Cliente

# basicInfoSection
source: Basic Information
es: Información Básica

# contactNameLabel
source: Contact Name *
es: Nombre del Contacto

# enterNameError
source: Please enter your name
es: Por favor ingresa tu nombre

# nameLengthError
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres

# companyLabel
source: Company *
es: Empresa *

# enterCompanyError
source: Please enter company
es: Por favor ingresa la empresa

# emailLabel
source: Email *
es: Correo electrónico *

# enterEmailError
source: Please enter email
es: Por favor ingresa el correo

# enterValidEmailError
source: Enter a valid email
es: Ingresa un correo válido

# phoneLabel
source: Phone
es: Teléfono

# addressLabel
source: Address
es: Dirección

# addressHelper
source: Street, number, etc.
es: Calle, número, etc.

# cityLabel
source: City
es: Ciudad

# zipCodeLabel
source: Zip Code
es: C.P.

# searchCountryHint
source: Search country
es: Buscar país

# additionalNotesSection
source: Additional Notes
es: Notas Adicionales

# additionalNotesHelper
source: Additional info about client
es: Información adicional sobre el cliente

# createClientButton
source: Create Client
es: Crear Cliente

# clientCreatedSuccess
source: Client created successfully
es: Cliente creado exitosamente

# createClientError
source: Error creating client
es: Error al crear cliente

# editClientTitle
source: Edit Client
es: Editar Cliente

# saveChangesButton
source: Save Changes
es: Guardar Cambios

# clientUpdatedSuccess
source: Client updated successfully
es: Cliente actualizado exitosamente

# updateClientError
source: Error updating client
es: Error al actualizar cliente

# myProjectsTitle
source: My Projects
es: Mis Proyectos

# logoutTitle
source: Logout
es: Cerrar sesión

# logoutConfirmMessage
source: Are you sure you want to exit?
es: ¿Estás seguro de que quieres salir?

# exitButton
source: Exit
es: Salir

# welcomeUser
source: Hello, {name}
es: Hola, {name}

# clientDashboardSubtitle
source: Here you can see the status of your products in real time
es: Aquí puedes ver el estado de tus productos en tiempo real

# noAssignedProjects
source: You have no assigned projects
es: No tienes proyectos asignados

# noAssignedProjectsSubtitle
source: Projects will appear when a manufacturer assigns you as a client
es: Los proyectos aparecerán cuando un fabricante te asigne como cliente

# currentStatusLabel
source: Current Status
es: Estado actual

# lastUpdateDateLabel
source: Last update: {date}
es: Última actualización: {date}

# productionProgressSection
source: Production Progress
es: Progreso de producción

# stagesHistorySection
source: Stage History
es: Historial de etapas

# stageStartLabel
source: Start: {date}
es: Inicio: {date}

# stageEndLabel
source: End: {date}
es: Fin: {date}

# stagesProgress
source: {completed} of {total} stages completed
es: {completed} de {total} etapas completadas

# registerTitle
source: Create Account
es: Crear cuenta

# completeDetails
source: Complete your details
es: Completa tus datos

# fullNameLabel
source: Full Name
es: Nombre completo

# nameMinLengthError
source: Name must be at least 3 characters
es: El nombre debe tener al menos 3 caracteres

# passwordMinLengthHelper
source: Minimum 6 characters
es: Mínimo 6 caracteres

# enterPasswordError
source: Please enter a password
es: Por favor ingresa una contraseña

# passwordMinLengthError
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# confirmPasswordLabel
source: Confirm Password
es: Confirmar contraseña

# passwordsDoNotMatchError
source: Passwords do not match
es: Las contraseñas no coinciden

source: Hide optional fields
es: Ocultar campos opcionales

# showOptionalFields
source: Add additional info (optional)
es: Agregar información adicional (opcional)

# phoneOptionalLabel
source: Phone (optional)
es: Teléfono (opcional)

# phoneHelper
source: Ex: +34 123 456 789
es: Ej: +34 123 456 789

# accountCreatedSuccess
source: Account created successfully
es: Cuenta creada exitosamente

# registerError
source: Error registering user
es: Error al registrar usuario

# termsAndConditions
source: By creating an account, you agree to our Terms and Conditions and Privacy Policy
es: Al crear una cuenta, aceptas nuestros Términos y Condiciones y Política de Privacidad

# loginError
source: Error logging in
es: Error al iniciar sesión

# accountTypeTitle
source: Account Type
es: Tipo de cuenta

# selectAccountTypeMessage
source: Select the type of account you want to create:
es: Selecciona el tipo de cuenta que deseas crear:

# roleClient
source: Client
es: Cliente

# roleClientSubtitle
source: View products
es: Ver productos

# roleManufacturer
source: Manufacturer
es: Fabricante

# roleManufacturerSubtitle
source: Manage production
es: Gestionar producción

# roleOperator
source: Operator
es: Operario

# roleOperatorSubtitle
source: Operate processes
es: Operar procesos

# roleAccountant
source: Accountant
es: Contable

# roleAccountantSubtitle
source: Financial management
es: Gestión financiera

# googleLoginError
source: Error logging in with Google
es: Error al iniciar sesión con Google

# appTitle
source: Production Management
es: Gestión de Producción

# loginSubtitle
source: Sign in to continue
es: Inicia sesión para continuar

# forgotPasswordLink
source: Forgot password?
es: ¿Olvidaste tu contraseña?

# loginButton
source: Login
es: Iniciar Sesión

source: Or continue with
es: O continuar con

source: Continue with Google
es: Continuar con Google

# recoverPasswordTitle
source: Recover Password
es: Recuperar contraseña

# recoverPasswordSubtitle
source: Enter your email and we will send you a link to reset your password
es: Ingresa tu correo electrónico y te enviaremos un enlace para restablecer tu contraseña

# emailAssociatedHelper
source: Enter the email associated with your account
es: Ingresa el correo asociado a tu cuenta

# sendRecoveryLinkButton
source: Send recovery link
es: Enviar enlace de recuperación

# backToLoginButton
source: Back to login
es: Volver al inicio de sesión

# recoveryEmailSentError
source: Error sending recovery email
es: Error al enviar correo de recuperación

# emailSentTitle
source: Email sent!
es: ¡Correo enviado!

# emailSentSubtitle
source: We have sent a recovery link to:
es: Hemos enviado un enlace de recuperación a:

# checkInboxMessage
source: Check your inbox and follow the instructions to reset your password.
es: Revisa tu bandeja de entrada y sigue las instrucciones del correo para restablecer tu contraseña.

# checkSpamMessage
source: If you don't receive the email in a few minutes, check your spam folder.
es: Si no recibes el correo en unos minutos, revisa tu carpeta de spam.

# sendToAnotherEmailButton
source: Send to another email
es: Enviar a otro correo

# catalogTitle
source: Product Catalog
es: Catálogo de Productos

source: Filter by category
es: Filtrar por categoría

source: All categories
es: Todas las categorías

source: Show inactive
es: Mostrar inactivos

source: Hide inactive
es: Ocultar inactivos

# searchCatalogHint
source: Search by name, reference or description...
es: Buscar por nombre, referencia o descripción...

source: No products found
es: No se encontraron productos

# noProductsInCatalog
source: No products in the catalog
es: No hay productos en el catálogo

# tryOtherSearchTerms
source: Try with other search terms
es: Intenta con otros términos de búsqueda

# createFirstProduct
source: Create your first product
es: Crea tu primer producto

source: New Product
es: Nuevo Producto

# deactivateProductTitle
source: Deactivate product
es: Desactivar producto

# reactivateProductTitle
source: Reactivate product
es: Reactivar producto

# deactivateProductMessage
source: Do you want to deactivate "{name}"? It will not be deleted, just hidden.
es: ¿Deseas desactivar "{name}"? No se eliminará, solo quedará oculto.

# reactivateProductMessage
source: Do you want to reactivate "{name}"?
es: ¿Deseas reactivar "{name}"?

# productDeactivatedSuccess
source: Product deactivated successfully
es: Producto desactivado correctamente

# productReactivatedSuccess
source: Product reactivated successfully
es: Producto reactivado correctamente

# productUpdateError
source: Error updating product
es: Error al actualizar el producto

# inactiveStatus
source: Inactive
es: Inactivo

# usedCount
source: Used {count, plural, =1{1 time} other{{count} times}}
es: Usado {count, plural, =1{1 vez} other{{count} veces}}

# usedLabel
source: Used
es: Usado

# timeUsageSingle
source: time
es: vez

# timeUsageMultiple
source: times
es: veces

# editProductTitle
source: Edit Product
es: Editar Producto

# basicInfo
source: Basic Information
es: Información Básica

# productNameLabel
source: Product Name *
es: Nombre del producto *

# productNameHint
source: Ex: Rustic dining table
es: Ej: Mesa de comedor rústica

# nameRequired
source: Name is required
es: El nombre es obligatorio

# referenceLabel
source: Reference
es: Referencia

# referenceHint
source: Ex: TABLE-001
es: Ej: MESA-001

# referenceRequired
source: Reference is required
es: La referencia es obligatoria

source: Description label
es: Etiqueta de descripción

# descriptionHint
source: Describe the product...
es: Describe el producto...

# descriptionRequired
source: Description is required
es: La descripción es obligatoria

# categoryLabel
source: Category
es: Categoría

# categoryHint
source: Ex: Furniture
es: Ej: Muebles

# availabilityTitle
source: Availability
es: Disponibilidad

source: Public Product
es: Producto público

source: Private Product
es: Producto privado

# publicProductSubtitle
source: Available to all clients
es: Disponible para todos los clientes

# privateProductSubtitle
source: Only for specific client
es: Solo para cliente específico

# specificClientLabel
source: Specific Client *
es: Cliente específico *

# specificClientHelper
source: This product will only be available to this client
es: Este producto solo estará disponible para este cliente

# noClientsAvailable
source: No clients available. Create a client first.
es: No hay clientes disponibles. Crea un cliente primero.

# privateProductInfo
source: Only this client will be able to add this product to their production batches.
es: Solo este cliente podrá añadir este producto a sus lotes de producción.

# selectClientError
source: You must select a client
es: Debes seleccionar un cliente

# productCreatedPublicSuccess
source: Public product created successfully
es: Producto público creado exitosamente

# productCreatedPrivateSuccess
source: Product created for {client}
es: Producto creado para {client}

# productEditedSuccess
source: Product edited for {client}
es: Producto editado para {client}

# createProductError
source: Error creating product
es: Error al crear el producto

# dimensionsLabel
source: Dimensions ({unit})
es: Dimensiones ({unit})

# widthLabel
source: Width
es: Ancho

# heightLabel
source: Height
es: Alto

# depthLabel
source: Depth
es: Fondo

# primaryMaterialLabel
source: Primary Material
es: Material principal

# primaryMaterialHint
source: Ex: Oak wood
es: Ej: Madera de roble

# secondaryMaterialsLabel
source: Secondary Materials
es: Materiales secundarios

# secondaryMaterialsHint
source: Ex: Stainless steel
es: Ej: Acero inoxidable

# finishLabel
source: Finish
es: Acabado

# finishHint
source: Ex: Varnished
es: Ej: Barnizado

# colorHint
source: Ex: Walnut
es: Ej: Nogal

# additionalDataTitle
source: Additional Data
es: Datos Adicionales

# estimatedWeightLabel
source: Estimated Weight
es: Peso estimado

# basePriceLabel
source: Base Price
es: Precio base

# tagsLabel
source: Tags
es: Etiquetas

# tagsHint
source: Ex: Premium, Modern
es: Ej: Premium, Moderno

# notesLabel
source: Notes
es: Notas

# notesHint
source: Optional remarks
es: Observaciones opcionales

source: Unsaved changes
es: Cambios sin guardar

# unsavedChangesTitle
source: Unsaved changes
es: Cambios sin guardar

# unsavedChangesMessage
source: Are you sure you want to exit? Unsaved changes will be lost.
es: ¿Estás seguro que quieres salir? Los cambios no guardados se perderán.

source: Discard
es: Descartar

# productDetailTitle
source: Product Detail
es: Detalle de Producto

source: Product not found
es: Producto no encontrado

source: Duplicate
es: Duplicar

# duplicateTitle
source: Duplicate product
es: Duplicar producto

# duplicateConfirmMessage
source: Do you want to create a copy of "{name}"? A new reference will be generated automatically.
es: ¿Deseas crear una copia de "{name}"? Se generará automáticamente una nueva referencia.

# productDuplicatedSuccess
source: Product duplicated successfully
es: Producto duplicado correctamente

# duplicateError
source: Error duplicating product
es: Error al duplicar el producto

# deleteTitle
source: Delete product
es: Eliminar producto

# deleteConfirmMessage
source: Are you sure you want to permanently delete "{name}"? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar permanentemente "{name}"? Esta acción no se puede deshacer.

# productDeletedSuccess
source: Product deleted successfully
es: Producto eliminado correctamente

# productIsInactiveMessage
source: This product is deactivated
es: Este producto está desactivado

source: Specifications
es: Especificaciones

# systemInfoTitle
source: System Information
es: Información del Sistema

# createProductBtn
source: Create product
es: Crear producto

# statusUpdateError
source: Error updating status
es: Error al actualizar estado

# phasesInitializedSuccess
source: Phases initialized successfully
es: Fases inicializadas correctamente

# copy
source: Copiar
es: Copia

# assignPhasesTitle
source: Assign Phases
es: Asignar Fases

# cleanSelection
source: Clear selection
es: Limpiar selección

# selectPhasesInstruction
source: Select phases they can manage
es: Selecciona las fases que puede gestionar

# noRestrictionsLabel
source: No restrictions (can manage all)
es: Sin restricciones (puede gestionar todas)

# phasesSelectedLabel
source: Selected phases
es: Fases seleccionadas

# assignmentsSavedSuccess
source: Assignments saved successfully
es: Asignaciones guardadas correctamente

source: Error loading assignments
es: Error al cargar asignaciones

# noActivePhasesAvailable
source: No active phases available. Configure phases in organization settings.
es: No hay fases activas disponibles. Configure las fases en la gestión de organización.

# managePhasesTitle
source: Manage Phases
es: Gestión de Fases

# initializePhasesTitle
source: Initialize Phases
es: Inicializar Fases

# initializePhasesConfirmMessage
source: Do you want to create default production phases? This will add standard process phases.
es: ¿Deseas crear las fases de producción predeterminadas? Esto añadirá las fases estándar del proceso.

# initializePhasesButton
source: Initialize Phases
es: Inicializar Fases

source: Phase deactivated
es: Fase desactivada

source: Phase activated
es: Fase activada

# editPhaseTitle
source: Edit Phase
es: Editar Fase

# phaseDescriptionLabel
source: Description (optional)
es: Descripción (opcional)

# phaseUpdatedSuccess
source: Phase updated successfully
es: Fase actualizada correctamente

# noPhasesConfiguredTitle
source: No phases configured
es: No hay fases configuradas

# noPhasesConfiguredSubtitle
source: Initialize default phases to start
es: Inicializa las fases predeterminadas para comenzar

# activePhasesSection
source: Active Phases
es: Fases Activas

# inactivePhasesSection
source: Inactive Phases
es: Fases Inactivas

# activateAction
source: Activate
es: Activar

# deactivateAction
source: Deactivate
es: Desactivar

# totalPhasesLabel
source: Total phases
es: Total de fases

# activePhasesNote
source: Active phases will be automatically applied to all new products.
es: Las fases activas se aplicarán automáticamente a todos los productos nuevos.

# joinOrganizationTitle
source: Join Organization
es: Unirse a Organización
