Repository: Technoka/production_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# statusHoldDesc
source: Product sent to client for evaluation
es: Producto enviado al cliente para evaluación

# statusCAODesc
source: Product with defects reported by client
es: Producto con defectos reportados por el cliente

# statusControlDesc
source: Product in quality control for classification
es: Producto en control de calidad para clasificación

# statusOKDesc
source: Product approved and finished
es: Producto aprobado y finalizado

source: Status Transitions
es: Transiciones de Estado

source: Transition
es: Transición

# fromStatus
source: From
es: Desde

# toStatus
source: To
es: Hacia

source: Allowed Transitions
es: Transiciones Permitidas

source: Configure Transition
es: Configurar Transición

# transitionCreated
source: Transition created successfully
es: Transición creada correctamente

# transitionUpdated
source: Transition updated successfully
es: Transición actualizada correctamente

# transitionDeleted
source: Transition deleted successfully
es: Transición eliminada correctamente

source: Validations
es: Validaciones

source: Validation Type
es: Tipo de Validación

source: Validation Required
es: Validación Requerida

# validationText
source: Required text
es: Texto obligatorio

# validationNumber
source: Required number
es: Número requerido

# validationDefectiveQuantity
source: Defective quantity
es: Cantidad defectuosa

# validationApproval
source: Requires approval
es: Requiere aprobación

# validationFile
source: Required file
es: Archivo obligatorio

# conditionalLogic
source: Logic
es: Lógica

source: Condition
es: Condición

source: Action
es: Acción

# ifCondition
source: If
es: Si

# thenAction
source: Then
es: Entonces

source: Defective greater than
es: Defectuosos mayor que

source: Requires approval from
es: Requiere aprobación de

source: Block transition
es: Bloquear transición

source: Show warning
es: Mostrar advertencia

source: Notify roles
es: Notificar roles

source: Status History
es: Historial de Estados

source: Changed to
es: Cambió a

source: Changed by
es: Cambiado por

# changedAt
source: Change date
es: Fecha de cambio

source: Validation data
es: Datos de validación

# noStatusHistory
source: No change history
es: Sin historial de cambios

source: Special Permissions
es: Permisos Especiales

source: Client Permissions
es: Permisos del Cliente

source: Can create batches
es: Puede crear lotes

source: Requires approval
es: Requiere aprobación

# canViewAllProjects
source: View all projects
es: Ver todos los proyectos

source: Standard client
es: Cliente estándar

source: Privileged client
es: Cliente privilegiado

source: Initializing roles...
es: Inicializando roles...

source: Initializing statuses...
es: Inicializando estados...

# rolesInitialized
source: Roles initialized successfully
es: Roles inicializados correctamente

# statusesInitialized
source: Statuses initialized successfully
es: Estados inicializados correctamente

source: Initialization complete
es: Inicialización completada

source: Initialization error
es: Error en la inicialización

source: Insufficient permissions
es: Permisos insuficientes

source: Permission denied
es: Permiso denegado

source: Role not found
es: Rol no encontrado

source: Status not found
es: Estado no encontrado

source: Invalid transition
es: Transición no válida

source: Validation failed
es: Validación fallida

source: Approval required
es: Requiere aprobación

# contactAdminForPermissions
source: Contact an administrator for permissions
es: Contacta con un administrador para obtener permisos

# editProjectTitle
source: Edit Project
es: Editar Proyecto

source: Project Information
es: Información del Proyecto

source: Client Information
es: Información del Cliente

source: Access Control
es: Control de Acceso

# accessControlDescription
source: Manage who can view and work with this project
es: Gestiona quiénes pueden ver y trabajar con este proyecto

source: Project Client
es: Cliente del Proyecto

source: Client cannot be changed
es: El cliente no puede modificarse

source: Contact Client
es: Contactar Cliente

# cannotEditProject
source: You don't have permission to edit this project
es: No tienes permisos para editar este proyecto

# cannotEditProjectDesc
source: Only assigned members or administrators can edit this project
es: Solo miembros asignados o administradores pueden editar este proyecto

# projectIsCompleted
source: This project is completed
es: Este proyecto está completado

# projectIsCompletedDesc
source: Completed projects cannot be edited
es: Los proyectos completados no pueden editarse

# projectIsCancelled
source: This project is cancelled
es: Este proyecto está cancelado

# projectIsCancelledDesc
source: Cancelled projects cannot be edited
es: Los proyectos cancelados no pueden editarse

# automaticAccess
source: Automatic access (no assignment needed)
es: Acceso automático (no necesitan asignación)

source: Assign additional members
es: Asignar miembros adicionales

# allMembersHaveAutoAccess
source: All members have automatic access
es: Todos los miembros tienen acceso automático

source: You
es: Tú

# removeMemberFromProject
source: Remove from project?
es: ¿Quitar del proyecto?

# removeMemberFromProjectDesc
source: Are you sure you want to remove {memberName} from this project?
es: ¿Estás seguro de quitar a {memberName} de este proyecto?

# memberHasProducts
source: This member has assigned products
es: Este miembro tiene productos asignados

# memberHasProductsWarning
source: Removing them may affect production tracking
es: Quitarlo puede afectar el seguimiento de producción

# memberRemoved
source: Member removed from project
es: Miembro eliminado del proyecto

# memberAdded
source: Member added to project
es: Miembro agregado al proyecto

# projectUpdatedSuccess
source: Project updated successfully
es: Proyecto actualizado exitosamente

# projectUpdateError
source: Error updating project
es: Error al actualizar el proyecto

source: Saving changes...
es: Guardando cambios...

source: Discard changes
es: Descartar cambios

# unsavedChangesDesc
source: You have unsaved changes. Do you want to discard them?
es: Tienes cambios sin guardar. ¿Deseas descartarlos?

source: View client details
es: Ver detalles del cliente

source: Client contact
es: Contacto del cliente

# loadingClientInfo
source: Loading client information...
es: Cargando información del cliente...

source: Required
es: Obligatorio

source: View by Phases
es: Vista por Fases

source: View by Status
es: Vista por Estados

source: Switch view
es: Cambiar vista

# phaseView
source: Production Phases
es: Fases de Producción

# statusView
source: Quality States
es: Estados de Calidad

# cannotMoveToPhase
source: You cannot move products to this phase
es: No puedes mover productos a esta fase

# cannotMoveFromPhase
source: You cannot move products from this phase
es: No puedes mover productos desde esta fase

# onlyAssignedPhases
source: You can only manage your assigned phases
es: Solo puedes gestionar tus fases asignadas

# phaseReadOnly
source: Read only
es: Solo lectura

# noAccessToPhase
source: No access to this phase
es: Sin acceso a esta fase

# cannotChangeStatus
source: You don't have permission to change status
es: No tienes permisos para cambiar el estado

# statusTransitionNotAllowed
source: This status transition is not allowed
es: Esta transición de estado no está permitida

# tooManyProducts
source: Too many products to display
es: Demasiados productos para mostrar

# tooManyProductsDesc
source: Showing only the first 100 products. Apply filters to see specific results.
es: Se muestran solo los primeros 100 productos. Aplica filtros para ver resultados específicos.

# applyFiltersPrompt
source: Apply filters to reduce results
es: Aplica filtros para reducir resultados

# showingProductsCount
source: Showing {count} products
es: Mostrando {count} productos

# productsInPhase
source: {count} products in this phase
es: {count} productos en esta fase

# productsInStatus
source: {count} products in this status
es: {count} productos en este estado

source: New Status
es: Nuevo Estado

source: Status Transition
es: Transición de Estado

source: Confirm status change
es: Confirmar cambio de estado

# statusChangedSuccess
source: Status changed successfully
es: Estado cambiado exitosamente

# statusChangeError
source: Error changing status
es: Error al cambiar el estado

source: Fill required fields
es: Rellena los campos requeridos para crear tu cuenta

source: Defect Description
es: Descripción del Defecto

source: Enter quantity
es: Ingresa la cantidad

# enterDescription
source: Describe the problem
es: Describe el problema

# approvalRequiredDesc
source: This change requires approval from {roles}
es: Este cambio requiere aprobación de {roles}

source: Pending Approval
es: Pendiente de aprobación

source: Loading phases...
es: Cargando fases...

source: Loading statuses...
es: Cargando estados...

source: Loading products...
es: Cargando productos...

# loadingPermissions
source: Checking permissions...
es: Verificando permisos...

# timeInPhase
source: {time} in this phase
es: {time} en esta fase

# timeInStatus
source: {time} in this status
es: {time} en este estado

# daysSingular
source: day
es: día

# daysPlural
source: days
es: días

# hoursSingular
source: hour
es: hora

# hoursPlural
source: hours
es: horas

source: Manage Permissions
es: Gestionar Permisos

# permissionsSaved
source: Permissions saved successfully
es: Permisos guardados correctamente

source: Base role
es: Rol base

source: customizations
es: personalizaciones

# roleAllowsButUserDenied
source: Role allows but this user has denied
es: El rol permite, pero este usuario tiene denegado

# roleDeniesButUserAllowed
source: Role denies but this user has allowed
es: El rol deniega, pero este usuario tiene permitido

source: Role scope
es: Alcance del rol

source: Retry
es: Reintentar

# noProductionAccess
source: You don't have access to production
es: Sin acceso a producción

source: Manage members
es: Gestionar miembros

source: Total Members
es: Miembros totales

source: Filter by Role
es: Filtrar por Rol

source: Filter by name
es: Filtrar por nombre

source: All Roles
es: Todos los Roles

# clientsCard
source: Clients
es: Clientes

source: Total Clients
es: Clientes totales

source: Role Distribution
es: Distribución por Rol

# viewingOwnPermissions
source: Viewing your permissions
es: Viendo tus permisos

# viewingOwnPermissionsDesc
source: You are viewing your own permissions. You cannot modify organization permissions to avoid losing access.
es: Estás viendo tus propios permisos. No puedes modificar los permisos de organización para evitar perder acceso.

# cannotModifyOrgPermissions
source: Cannot modify own organization permissions
es: No puedes modificar tus propios permisos de organización

source: Read-only mode
es: Modo lectura. No puedes enviar mensajes.

source: Pull to refresh
es: Desliza para actualizar

# noClientsMessage
source: No members registered as clients
es: No hay miembros registrados como clientes

source: Unknown user
es: Usuario desconocido

source: Without email
es: Sin email

source: Error loading user
es: Error cargando usuario

source: Owner
es: Propietario

source: Create product
es: Crear producto

source: Create product family
es: Crear familia de productos

source: Select client
es: Seleccionar cliente

source: Select project
es: Seleccionar proyecto

source: Select family
es: Seleccionar familia

source: Create family
es: Crear familia

source: Optional
es: opcional

source: Exit without saving
es: Salir sin guardar

source: Create New Family
es: Crear Nueva Familia

# familyNameLabel
source: Family name
es: Nombre de la familia

# familyNameHint
source: E.g: Handbags
es: Ej: Bolsos de mano

# createNewFamilyDescription
source: Enter the name of the new product family. You must create at least one product for the family to be registered.
es: Ingresa el nombre de la nueva familia de productos. Deberás crear al menos un producto para que la familia se registre.

# continueButton
source: Continue
es: Continuar

# productCreatedWithFamily
source: Family "{family}" and product created successfully
es: Familia "{family}" y producto creados exitosamente

# productCreatedSuccess
source: Product created successfully
es: Producto creado exitosamente

source: No projects for this client
es: No hay proyectos para este cliente

# selectClientFirst
source: Select a client first
es: Selecciona un cliente primero

# selectProjectFirst
source: Select a project first
es: Selecciona un proyecto primero

# noFamiliesCreateNew
source: No families, create a new one
es: No hay familias, crea una nueva

# createNewFamilyOption
source: Create new family
es: Crear nueva familia

# youMustCreateAProduct
source: You must also create a product for the family to be created
es: Debes crear un producto también para que la familia se cree

# productFamilyLabel
source: Product family
es: Familia de producto

source: Created by
es: Creado por

source: Updated by
es: Actualizado por

source: Times used
es: Veces usado

source: Only urgent
es: Solo urgentes

# clearFilters
source: Remove filters
es: Quitar filtros

source: Search batches...
es: Buscar lotes...

source: Search products...
es: Buscar productos...

source: Search in Kanban...
es: Buscar en Kanban...

source: Manage Product Statuses
es: Gestionar Estados de Productos

source: Delete Status
es: Eliminar Estado

source: Status Name
es: Nombre del Estado

# statusNameHint
source: Ex: Under Review
es: Ej: En Revisión

# statusDescription
source: Description
es: Descripción

# statusDescriptionHint
source: Describe what this status is used for
es: Describe para qué se usa este estado

# statusIcon
source: Icon
es: Icono

# statusPreview
source: Preview
es: Vista Previa

# systemStatus
source: System
es: Sistema

source: System Statuses
es: Estados del Sistema

source: Custom Statuses
es: Estados Personalizados

source: Custom Status
es: Estado Personalizado

# activeStatus
source: Active
es: Activo

source: Reorder Statuses
es: Reordenar Estados

# statusesReordered
source: Statuses reordered successfully
es: Estados reordenados correctamente

source: Error reordering statuses
es: Error al reordenar estados

# noStatusesFound
source: No statuses configured
es: No hay estados configurados

# createFirstStatus
source: Create your first custom status to get started
es: Crea tu primer estado personalizado para comenzar

# noCustomStatuses
source: No custom statuses. System statuses cannot be modified.
es: No hay estados personalizados. Los estados del sistema no pueden eliminarse.

# statusesDescription
source: Statuses allow you to classify products during production. System statuses cannot be modified.
es: Los estados permiten clasificar productos durante la producción. Los estados del sistema no pueden eliminarse.

# statusNameRequired
source: Name is required
es: El nombre es obligatorio

# statusNameTooShort
source: Name is too short
es: El nombre es demasiado corto

# statusDescriptionRequired
source: Description is required
es: La descripción es obligatoria

# statusNameExists
source: A status with this name already exists
es: Ya existe un estado con este nombre

# statusColorInvalid
source: Invalid color (use #RRGGBB format)
es: Color inválido (use formato #RRGGBB)

# deleteStatusConfirm
source: Are you sure you want to delete this status?
es: ¿Estás seguro de eliminar este estado?

# deleteStatusWarning
source: This action cannot be undone. Products with this status will be left unclassified.
es: Esta acción no se puede deshacer. Los productos con este estado quedarán sin clasificar.

# statusInUseCannotDelete
source: This status is in use by products and cannot be deleted
es: Este estado está en uso por productos y no puede eliminarse

source: Status activated
es: Estado activado

source: Status deactivated
es: Estado desactivado

source: Error creating status
es: Error al crear el estado

source: Error updating status
es: Error al actualizar el estado

source: Error deleting status
es: Error al eliminar el estado

# tapToSelectIcon
source: Tap to select an icon
es: Toca para seleccionar un icono

source: Done
es: Listo

source: Activate
es: Activar

source: Deactivate
es: Desactivar

# manageStatusTransitions
source: Manage Transitions
es: Gestionar Transiciones

source: Create Transition
es: Crear Transición

source: Edit Transition
es: Editar Transición

source: Delete Transition
es: Eliminar Transición

# transitionsDescription
source: Transitions define how products can change from one status to another, with specific validations and permissions.
es: Las transiciones definen cómo los productos pueden cambiar de un estado a otro, con validaciones y permisos específicos.

# filterByFromStatus
source: Filter by origin status
es: Filtrar por estado origen

source: Clear filter
es: Limpiar filtro

# hideInactiveTransitions
source: Hide inactive
es: Ocultar inactivas

# showInactiveTransitions
source: Show inactive
es: Mostrar inactivas

# noTransitionsFound
source: No transitions configured
es: No hay transiciones configuradas

# noTransitionsForStatus
source: No transitions for this status
es: No hay transiciones para este estado

# createFirstTransition
source: Create your first transition to get started
es: Crea tu primera transición para comenzar

# deleteTransitionConfirm
source: Are you sure you want to delete this transition?
es: ¿Estás seguro de eliminar esta transición?

# deleteTransitionWarning
source: Users will not be able to move products between these statuses.
es: Los usuarios no podrán mover productos entre estos estados.

source: Transition activated
es: Transición activada

source: Transition deactivated
es: Transición desactivada

source: Error creating transition
es: Error al crear la transición

source: Error updating transition
es: Error al actualizar la transición

source: Error deleting transition
es: Error al eliminar la transición

# transitionWizardSubtitle
source: Configure the transition between statuses step by step
es: Configura paso a paso la transición entre estados

source: Type
es: Tipo

source: Configuration
es: Configuración

source: Summary
es: Resumen

# step1Title
source: Step 1: Basic Configuration
es: Paso 1: Configuración Básica

# step1Description
source: Select the origin and destination statuses, and the roles that can execute this transition.
es: Selecciona los estados de origen y destino, y los roles que pueden ejecutar esta transición.

# step2Title
source: Step 2: Validation Type
es: Paso 2: Tipo de Validación

# step2Description
source: Choose what type of validation is required for this transition.
es: Elige qué tipo de validación se requiere para esta transición.

# step3Title
source: Step 3: Configure Validation
es: Paso 3: Configurar Validación

# step3Description
source: Define the specific parameters of the selected validation.
es: Define los parámetros específicos de la validación seleccionada.

# step4Title
source: Step 4: Conditional Logic (Optional)
es: Paso 4: Lógica Condicional (Opcional)

# step4Description
source: Add automatic rules that are evaluated based on the data entered.
es: Añade reglas automáticas que se evalúan según los datos ingresados.

# step5Title
source: Step 5: Summary
es: Paso 5: Resumen

# step5Description
source: Review all the configuration before saving.
es: Revisa toda la configuración antes de guardar.

# selectRolesDescription
source: Choose which roles can execute this transition
es: Elige qué roles pueden ejecutar esta transición

# selectAtLeastOneRole
source: You must select at least one role
es: Debes seleccionar al menos un rol

source: Previous
es: Anterior

# simpleApprovalInfo
source: This transition only requires confirmation. No additional configuration needed.
es: Esta transición solo requiere confirmación. No necesita configuración adicional.

source: Field label
es: Etiqueta del campo

# fieldLabelHint
source: Ex: Comment
es: Ej: Comentario

# minLength
source: Minimum length
es: Longitud mínima

# maxLength
source: Maximum length
es: Longitud máxima

# quantityLabelHint
source: Ex: Defective quantity
es: Ej: Cantidad defectuosa

source: Quantity range
es: Rango de cantidad

# minQuantity
source: Minimum quantity
es: Cantidad mínima

# maxQuantity
source: Maximum quantity
es: Cantidad máxima

# descriptionLabelHint
source: Ex: Defect description
es: Ej: Descripción del defecto

source: Checklist items
es: Items de la lista

source: Add item
es: Añadir item

source: Add checklist item
es: Añadir item de verificación

source: Item label
es: Etiqueta del item

# minPhotos
source: Minimum photos
es: Mínimo de fotos

# minPhotosHint
source: Ex: 2
es: Ej: 2

# minApprovals
source: Minimum approvals
es: Mínimo de aprobaciones

# minApprovalsHint
source: Ex: 2
es: Ej: 2

source: Validation Configuration
es: Configuración de Validación

source: No configuration required
es: No requiere configuración

source: Enable conditional logic
es: Habilitar lógica condicional

# conditionalLogicSubtitle
source: Add automatic rules based on entered data
es: Añade reglas automáticas basadas en los datos ingresados

source: Field
es: Campo

source: Operator
es: Operador

source: Value
es: Valor

# valueHint
source: Ex: 5
es: Ej: 5

source: Action type
es: Tipo de acción

source: Message
es: Mensaje

# messageHint
source: Message to display
es: Mensaje que se mostrará

source: Text length
es: Longitud del texto

# photoCount
source: Number of photos
es: Número de fotos

# approvalCount
source: Number of approvals
es: Número de aprobaciones

source: Greater than
es: Mayor que

source: Greater than or equal
es: Igual o mayor que

source: Less than
es: Menor que

source: Less than or equal
es: Igual o menor que

# equals
source: Equal to
es: Igual a

# notEquals
source: Not equal to
es: Diferente de

source: Contains
es: Contiene

source: Require approval
es: Requerir aprobación

source: Require additional field
es: Requerir campo adicional

source: Select approvers
es: Selecciona los aprobadores

# selectRolesToNotify
source: Select who to notify
es: Selecciona a quién notificar

source: Label
es: Etiqueta

source: Active
es: Activo

source: Inactive
es: Inactivo

source: Allowed roles
es: Roles permitidos

# allItemsRequired
source: All elements required
es: Todos los elementos requeridos

source: Confirm Transition
es: Confirmar Transición

# confirmTransitionMessage
source: Do you want to move this product to the next status?
es: ¿Deseas mover este producto al siguiente estado?

source: Total quantity
es: Cantidad total

source: Enter text
es: Ingresar texto

# enterTextHint
source: Write here...
es: Escribe aquí...

source: Text
es: Texto

# textTooShort
source: Text is too short
es: El texto es demasiado corto

source: Quantity and Description
es: Cantidad y Descripción

# describeIssue
source: Describe the issue
es: Describe el problema

source: Invalid number
es: Número inválido

source: Minimum value
es: Valor mínimo

source: Maximum value
es: Valor máximo

source: Range
es: Rango

# conditionalRuleTriggered
source: A conditional rule was triggered
es: Se activó una regla condicional

# approvalWillBeRequired
source: This transition will require additional approval
es: Esta transición requerirá aprobación adicional

source: Verification Checklist
es: Lista de Verificación

source: All items must be checked
es: Todos los items deben estar marcados

# itemsCompleted
source: completed
es: completados

# completeRequiredItems
source: Complete all required items
es: Completa todos los items obligatorios

source: Attach Photos
es: Adjuntar Fotos

# minPhotosRequired
source: Minimum photos required
es: Mínimo de fotos requeridas

source: Take Photo
es: Tomar Foto

source: Choose from Gallery
es: Elegir de Galería
