Repository: Technoka/production_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# joinOrganizationSuccess
source: Successfully joined the organization
es: Te has unido a la organización exitosamente

# joinOrganizationError
source: Error joining organization
es: Error al unirse a la organización

# inviteCodeTitle
source: Invitation Code
es: Código de Invitación

# inviteCodeSubtitle
source: Enter the code provided by your organization
es: Ingresa el código que te proporcionó tu organización

# inviteCodeLabel
source: Code
es: Código

# inviteCodeHelper
source: Format: ABCD1234 (8 characters)
es: Formato: ABCD1234 (8 caracteres)

# inviteCodeLengthError
source: Code must be 8 characters long
es: El código debe tener 8 caracteres

# enterInviteCodeError
source: Please enter the code
es: Por favor ingresa el código

# inviteCodeInfoBox
source: The invitation code is unique for each organization and allows instant access.
es: El código de invitación es único para cada organización y te permitirá unirte instantáneamente.

# joinButton
source: Join
es: Unirse

# inviteMemberTitle
source: Invite Member
es: Invitar Miembro

# inviteSentSuccess
source: Invitation sent successfully
es: Invitación enviada exitosamente

# inviteSendError
source: Error sending invitation
es: Error al enviar invitación

# inviteByEmailTitle
source: Invite by Email
es: Invitar por Email

# inviteByEmailSubtitle
source: Send an invitation to join your organization
es: Envía una invitación para unirse a tu organización

# emailInputLabel
source: Email address
es: Correo electrónico

# emailInputHelper
source: Enter user's email to invite
es: Ingresa el email del usuario a invitar

# aboutInvitationsTitle
source: About invitations
es: Sobre las invitaciones

# inviteInfoExpiration
source: Invitation expires in 7 days
es: La invitación expira en 7 días

# inviteInfoReceive
source: User will receive the invitation upon login
es: El usuario recibirá la invitación al iniciar sesión

# inviteInfoCreateAccount
source: If user has no account, they must create one first
es: Si el usuario no tiene cuenta, debe crearla primero

# inviteInfoExisting
source: You can only invite users not belonging to another organization
es: Solo puedes invitar usuarios que no pertenezcan a otra organización

# sendInviteButton
source: Send Invitation
es: Enviar Invitación

# newOrganizationTitle
source: New Organization
es: Nueva Organización

# createOrganizationSubtitle
source: Create your organization to manage team and projects
es: Crea tu organización para gestionar tu equipo y proyectos

# orgNameLabel
source: Organization Name
es: Nombre de la organización

# orgNameHelper
source: Ex: My Company LLC
es: Ej: Mi Empresa S.L.

# orgNameError
source: Please enter the name
es: Por favor ingresa el nombre

# orgNameLengthError
source: Name must be at least 3 characters
es: El nombre debe tener al menos 3 caracteres

# orgDescriptionLabel
source: Description
es: Descripción

# orgDescriptionHelper
source: Briefly describe your organization
es: Describe brevemente tu organización

# orgDescriptionError
source: Please enter a description
es: Por favor ingresa una descripción

# orgDescriptionLengthError
source: Description must be at least 10 characters
es: La descripción debe tener al menos 10 caracteres

# creatorBenefitsTitle
source: As creator you will have:
es: Como creador tendrás:

# benefitControl
source: Full control over the organization
es: Control total sobre la organización

# benefitInvite
source: Ability to invite members
es: Capacidad de invitar miembros

# benefitRoles
source: Role and permission management
es: Gestión de roles y permisos

# benefitProjects
source: Project administration
es: Administración de proyectos

# peopleLabel
source: people
es: personas

source: No members found
es: No se encontraron miembros

# ownerRole
source: Owner
es: Propietario

# removeAdminAction
source: Remove Admin
es: Quitar Admin

# makeAdminAction
source: Make Admin
es: Hacer Admin

# removeMemberAction
source: Remove
es: Expulsar

# removeMemberTitle
source: Remove member?
es: ¿Expulsar miembro?

# removeMemberConfirmPart1
source: Are you sure you want to remove
es: ¿Estás seguro de eliminar a

# removeMemberConfirmPart2
source: from the organization?
es: de la organización?

# updateMemberError
source: Error updating member
es: Error al actualizar el miembro

# myOrganizationTitle
source: My Organization
es: Mi Organización

# noOrganizationTitle
source: You do not belong to any organization
es: No perteneces a ninguna organización

# noOrganizationSubtitle
source: Create your own organization or join an existing one
es: Crea tu propia organización o únete a una existente

# createMyOrganizationBtn
source: Create my organization
es: Crear mi organización

# orLabel
source: or
es: o

# joinWithCodeBtn
source: Join with code
es: Unirse con código

# tapToViewLabel
source: Tap to view
es: Toca para ver

# pendingInvitationPrefix
source: You have
es: Tienes

# pendingInvitationSuffixSingle
source: pending invitation
es: invitación pendiente

# pendingInvitationSuffixPlural
source: pending invitations
es: invitaciones pendientes

# shareCodeLabel
source: Share this code
es: Comparte este código

source: Code copied
es: Código copiado

# copyCodeTooltip
source: Copy code
es: Copiar código

# regenerateCodeAction
source: Regenerate code
es: Regenerar código

# regenerateCodeWarning
source: Are you sure? The previous code will stop working.
es: ¿Estás seguro? El código anterior dejará de funcionar.

# regenerateBtn
source: Regenerate
es: Regenerar

# codeRegeneratedSuccess
source: Code regenerated
es: Código regenerado

# actionsTitle
source: Actions
es: Acciones

# managePhasesSubtitle
source: Configure production phases
es: Configurar fases de producción

# viewMembersAction
source: View members
es: Ver miembros

# inviteMemberAction
source: Invite member
es: Invitar miembro

# leaveOrganizationAction
source: Leave organization
es: Salir de la organización

# leaveOrganizationWarning
source: Are you sure you want to leave this organization? You will lose access to all projects and data.
es: ¿Estás seguro de que deseas salir de esta organización? Perderás acceso a todos los proyectos y datos.

# leaveOrganizationSuccess
source: You have left the organization
es: Has salido de la organización

# pendingInvitationsTitle
source: Pending Invitations
es: Invitaciones Pendientes

source: No pending invitations
es: No tienes invitaciones pendientes

# invitedByLabel
source: Invited by:
es: Invitado por:

# rejectAction
source: Reject
es: Rechazar

# acceptAction
source: Accept
es: Aceptar

# invitationRejectedMsg
source: Invitation rejected
es: Invitación rechazada

# selectColorTitle
source: Select Color
es: Seleccionar Color

# currentLanguagesLabel
source: Currently: Spanish, English
es: Actualmente: Español, English

# productionTitle
source: Production
es: Producción

# batchesTitle
source: Production Batches
es: Lotes de Producción

# activeBatchesTitle
source: Active Batches
es: Lotes Activos

source: No batches found
es: No se encontraron lotes

# createBatchBtn
source: Create Batch
es: Crear Lote

# newBatchTitle
source: New Batch
es: Nuevo Lote

# newBatchSubtitle
source: Create a new production batch
es: Crear un nuevo lote de producción

# batchNameLabel
source: Batch Name
es: Nombre del lote

# batchNameHint
source: Ex: January 2024 Production
es: Ej: Producción Enero 2024

# batchNameError
source: Please enter a name
es: Por favor ingresa un nombre

# batchCreatedSuccess
source: Batch created successfully
es: Lote creado exitosamente

# batchStatusDraft
source: Draft
es: Borrador

# batchStatusInProgress
source: In Progress
es: En Proceso

# batchStatusCompleted
source: Completed
es: Completado

# batchStatusCancelled
source: Cancelled
es: Cancelado

# batchDetailTitle
source: Batch Detail
es: Detalle del Lote

# addProductBtn
source: Add Product
es: Añadir Producto

# startProductionBtn
source: Start Production
es: Iniciar Producción

# completeBatchBtn
source: Complete Batch
es: Completar Lote

# deleteBatchAction
source: Delete Batch
es: Eliminar Lote

# deleteBatchConfirmTitle
source: Delete batch?
es: ¿Eliminar lote?

# deleteBatchConfirmMsg
source: This action cannot be undone and will delete all associated data.
es: Esta acción no se puede deshacer y eliminará todos los datos asociados.

# batchDeletedSuccess
source: Batch deleted successfully
es: Lote eliminado correctamente

# batchStartedSuccess
source: Production started
es: Producción iniciada

# batchCompletedSuccess
source: Batch marked as completed
es: Lote marcado como completado

# noProductsInBatch
source: No products in this batch
es: No hay productos en este lote

# productsTitle
source: Products
es: Productos

# addProductsTitle
source: Add Products
es: Añadir Productos

# selectProductsInstruction
source: Select products to add to the batch
es: Selecciona los productos para añadir al lote

# noAvailableProducts
source: No available products to add
es: No hay productos disponibles para añadir

# addSelectedBtn
source: Add selected
es: Añadir seleccionados

# productsAddedSuccess
source: Products added successfully
es: Productos añadidos correctamente

# currentPhaseLabel
source: Current Phase
es: Fase actual

# historyTitle
source: History
es: Historial

# moveNextPhaseBtn
source: Next Phase
es: Avanzar Fase

source: Search messages
es: Buscar mensajes

# searchingMessages
source: Searching...
es: Buscando...

# writeToSearch
source: Type to search
es: Escribe para buscar

source: Search in messages
es: Buscar en mensajes

# searchPlaceholder
source: Search in content, names or mentions
es: Buscar en el contenido, nombres o menciones

source: Message found
es: Mensaje encontrado

source: No pinned messages
es: No hay mensajes fijados

# chatOfBatch
source: Batch chat
es: Chat del lote

# chatOfProject
source: Project chat
es: Chat del proyecto

# chatOfProduct
source: Product chat
es: Chat del producto

source: Yesterday
es: Ayer

# eventBatchCreated
source: Batch created
es: Lote creado

# eventBatchStarted
source: Production started
es: Producción iniciada

# eventBatchCompleted
source: Batch completed
es: Lote completado

# eventBatchStatusChanged
source: Status changed
es: Estado cambiado

# eventPhaseCompleted
source: Phase completed
es: Fase completada

# eventProductMoved
source: Product moved to phase
es: Producto movido de fase

# eventProductAdded
source: Product added
es: Producto añadido

# eventProductRemoved
source: Product removed
es: Producto eliminado

# eventProductStatusChanged
source: Product status changed
es: Estado del producto cambiado

# eventDelayDetected
source: Delay detected
es: Retraso detectado

# eventMemberAssigned
source: Member assigned
es: Miembro asignado

# eventMemberRemoved
source: Member removed
es: Miembro removido

# eventInvoiceIssued
source: Invoice issued
es: Factura emitida

# eventPaymentReceived
source: Payment received
es: Pago recibido

# eventNoteAdded
source: Note added
es: Nota añadida

# eventFileUploaded
source: File uploaded
es: Archivo subido

# eventProjectCreated
source: Project created
es: Proyecto creado

# eventProjectCompleted
source: Project completed
es: Proyecto completado

# eventDeadlineApproaching
source: Deadline approaching
es: Fecha de entrega próxima

# eventQualityCheckCompleted
source: Quality check
es: Control de calidad

# eventMaterialAssigned
source: Material assigned
es: Material asignado

# allMasculine
source: All
es: Todo

# allFemenine
source: All
es: Toda

# allPluralMasculine
source: All
es: Todos

# allPluralFeminine
source: All
es: Todas

source: All clients
es: Todos los clientes

# batchesViewTitleLabel
source: View batches
es: Vista por lotes

# productsViewTitleLabel
source: View orders
es: Vista por pedidos

source: Hello
es: Hola

source: Management
es: Gestión

# listView
source: List
es: Lista

# foldersView
source: Folders
es: Carpetas

# viewDetailsTooltip
source: View details
es: Ver detalles

# noProjectsForClient
source: No projects for this client
es: No hay proyectos para este cliente

source: Client not found
es: Cliente no encontrado

source: Project not found
es: Proyecto no encontrado

source: complete
es: completado

# urgentLabel
source: URGENT
es: URGENTE

# projectsCount
source: {count, plural, =0 {No projects} =1 {1 Project} other {{count} Projects}}
es: {count, plural, =0 {Sin proyectos} =1 {1 Proyecto} other {{count} Proyectos}}

# productsCount
source: {count, plural, =0 {No products} =1 {1 Product} other {{count} Products}}
es: {count, plural, =0 {Sin productos} =1 {1 Producto} other {{count} Productos}}

# urgentCount
source: {count} urgent
es: {count} urgentes

source: Start date
es: Fecha inicio

source: Due date
es: Fecha entrega

source: View project details
es: Ver detalles del proyecto

source: Contact info
es: Información de contacto

source: family
es: familia

source: families
es: familias

source: Uncategorized
es: Sin categoría

# noFamiliesInProject
source: No product families in this project
es: No hay familias de productos en este proyecto

# noProductsInFamily
source: No products in this family
es: No hay productos en esta familia

source: Uploading photo...
es: Subiendo foto...

source: Photo updated
es: Foto actualizada

# profileUpdatedSuccess
source: Profile updated successfully
es: Perfil actualizado exitosamente

# updateProfileError
source: Error updating profile
es: Error al actualizar perfil

# emailReadOnlyHelper
source: Email cannot be modified
es: El correo no se puede modificar

source: Account Type
es: Tipo de cuenta

# roleReadOnlyHelper
source: Account type cannot be modified
es: El tipo de cuenta no se puede modificar

# myProfileTitle
source: My Profile
es: Mi Perfil

# personalInfo
source: Personal Information
es: Información Personal

source: Member since
es: Miembro desde

# securityTitle
source: Security
es: Seguridad

source: Change password
es: Cambiar contraseña

# googleAccountAlert
source: Not available for Google accounts
es: No disponible para cuentas de Google

# updatePasswordSubtitle
source: Update your password
es: Actualiza tu contraseña

# accountSection
source: Account
es: Cuenta

# changePasswordTitle
source: Change Password
es: Cambiar Contraseña

# passwordUpdatedSuccess
source: Password updated successfully
es: Contraseña actualizada exitosamente

# changePasswordError
source: Error changing password
es: Error al cambiar contraseña

# securePasswordAdvice
source: Make sure to use a secure password
es: Asegúrate de usar una contraseña segura

# currentPasswordLabel
source: Current password
es: Contraseña actual

# enterCurrentPasswordError
source: Please enter your current password
es: Por favor ingresa tu contraseña actual

# newPasswordLabel
source: New password
es: Nueva contraseña

# enterNewPasswordError
source: Please enter a new password
es: Por favor ingresa una nueva contraseña

# passwordDiffError
source: New password must be different
es: La nueva contraseña debe ser diferente a la actual

# confirmNewPasswordLabel
source: Confirm new password
es: Confirmar nueva contraseña

# passwordTipsTitle
source: Tips for a secure password:
es: Consejos para una contraseña segura:

# passwordTip1
source: Use at least 8 characters
es: Usa al menos 8 caracteres

# passwordTip2
source: Combine uppercase and lowercase letters
es: Combina letras mayúsculas y minúsculas

# passwordTip3
source: Include numbers and symbols
es: Incluye números y símbolos

# passwordTip4
source: Do not use personal information
es: No uses información personal

# editProfileTitle
source: Edit profile
es: Editar perfil

source: Personal data updated
es: Datos personales actualizados

source: Phase Customization
es: Personalización de Fases

source: Color Picker
es: Selector de Color

source: Icon Picker
es: Selector de Icono

source: Select Color
es: Seleccionar Color

source: Select Icon
es: Seleccionar Icono

source: Current color
es: Color actual

source: Current icon
es: Icono actual

source: WIP Settings
es: Configuración WIP

# wipLimitLabel
source: WIP Limit
es: Límite WIP

# wipLimitHelper
source: Maximum products allowed in this phase
es: Máximo de productos permitidos en esta fase

# wipLimitError
source: WIP limit must be greater than 0
es: El límite WIP debe ser mayor a 0

source: SLA Settings
es: Configuración SLA

# maxDurationLabel
source: Max Duration (hours)
es: Duración Máxima (horas)

# maxDurationHelper
source: Maximum time allowed in this phase
es: Tiempo máximo permitido en esta fase

# warningThresholdLabel
source: Warning Threshold (%)
es: Umbral de Advertencia (%)

# warningThresholdHelper
source: Percentage for early alert (e.g. 80%)
es: Porcentaje para alerta temprana (ej: 80%)

source: SLA not configured
es: SLA no configurado

source: Enable SLA
es: Activar SLA

source: Disable SLA
es: Desactivar SLA

source: Reorder Phases
es: Reordenar Fases

source: Drag to reorder
es: Arrastra para reordenar

# orderSaved
source: Order saved successfully
es: Orden guardado correctamente

# invalidColorFormat
source: Invalid color format. Use #RRGGBB
es: Formato de color inválido

# phaseInUse
source: This phase cannot be deleted because it has associated products
es: Esta fase no se puede eliminar porque tiene productos asociados

# confirmDeletePhase
source: Delete phase permanently?
es: ¿Eliminar fase permanentemente?

# deletePhaseWarning
source: This action cannot be undone
es: Esta acción no se puede deshacer

# createPhaseTitle
source: Create New Phase
es: Crear Fase Nueva

# phaseNameLabel
source: Phase Name
es: Nombre de la Fase

# orderLabel
source: Order
es: Orden

source: Advanced Settings
es: Configuración Avanzada

# basicSettings
source: Basic
es: Básico

# phaseCreatedSuccess
source: Phase created successfully
es: Fase creada correctamente

# phaseDeletedSuccess
source: Phase deleted successfully
es: Fase eliminada correctamente

source: WIP limit reached
es: Límite WIP alcanzado

# wipLimitExceeded
source: WIP limit exceeded in
es: Se ha superado el límite WIP en

source: SLA Alerts
es: Alertas SLA

source: Active Alerts
es: Alertas Activas

source: Alert Details
es: Detalles de la Alerta

source: Acknowledge
es: Reconocer

source: Resolve
es: Resolver

source: Resolution Notes
es: Notas de Resolución

source: Alert acknowledged
es: Alerta reconocida

source: Alert resolved
es: Alerta resuelta

# noAlertsActive
source: No active alerts
es: No hay alertas activas

source: SLA Exceeded
es: SLA Superado

source: SLA Warning
es: Advertencia SLA

source: Phase Blocked
es: Fase Bloqueada

# wipLimitExceededAlert
source: WIP Limit Exceeded
es: Límite WIP Superado

# criticalSeverity
source: Critical
es: Crítico

# warningSeverity
source: Warning
es: Advertencia

# excessHours
source: Excess {hours}h
es: Exceso de {hours}h

source: Approaching limit
es: Aproximándose al límite

source: View alert
es: Ver alerta

source: Dismiss alert
es: Descartar alerta

source: Alerts Panel
es: Panel de Alertas

source: Filter by severity
es: Filtrar por severidad

source: Filter by status
es: Filtrar por estado

source: All severities
es: Todas las severidades

source: All statuses
es: Todos los estados

source: Excess
es: Exceso de

source: Metrics
es: Métricas

source: Overview
es: Resumen

source: Performance
es: Rendimiento

source: Trends
es: Tendencias

source: Active Projects
es: Proyectos Activos

source: Completed Projects
es: Proyectos Completados

source: Delayed Projects
es: Proyectos Retrasados

source: Products Completed
es: Productos Completados

source: Products In Progress
es: Productos en Proceso

source: Products Pending
es: Productos Pendientes

source: SLA Compliance
es: Cumplimiento SLA

source: Efficiency Score
es: Puntuación de Eficiencia

source: Average Time per Phase
es: Tiempo Promedio por Fase

source: Products per Phase
es: Productos por Fase

source: Bottlenecks
es: Cuellos de Botella

source: Phase Performance
es: Rendimiento de Fase

source: Completion Rate
es: Tasa de Finalización

source: Productivity
es: Productividad

source: Last 7 Days
es: Últimos 7 Días

source: Last 30 Days
es: Últimos 30 Días

source: Last 3 Months
es: Últimos 3 Meses

source: This Month
es: Este Mes

source: Last Month
es: Mes Pasado

# trendUp
source: Upward trend
es: Tendencia al alza

# trendDown
source: Downward trend
es: Tendencia a la baja

# trendStable
source: Stable trend
es: Tendencia estable

source: No data available
es: No hay datos disponibles

source: Loading metrics...
es: Cargando métricas...

source: Refresh data
es: Actualizar datos

source: Export report
es: Exportar reporte

source: View details
es: Ver detalles

source: Compared to last period
es: Comparado con el período anterior

source: hours
es: horas

source: days
es: días

source: Percentage change
es: Cambio porcentual

source: Permissions
es: Permisos

source: Role Management
es: Gestión de Roles

source: Assign Role
es: Asignar Rol

source: Change Role
es: Cambiar Rol

source: Role updated
es: Rol actualizado

# roleUpdateError
source: Error updating role
es: Error al actualizar rol

# roleOwner
source: Owner
es: Propietario

# roleAdmin
source: Administrator
es: Administrador

# roleProductionManager
source: Production Manager
es: Jefe de Producción

# roleQualityControl
source: Quality Control
es: Control de Calidad

# roleOwnerDesc
source: Full access to the entire organization
es: Acceso completo a toda la organización

# roleAdminDesc
source: Complete management except organization deletion
es: Gestión completa excepto eliminación de organización

# roleProductionManagerDesc
source: Complete production and batch management
es: Gestión completa de producción y lotes

# roleOperatorDesc
source: Operation of assigned phases
es: Operación de fases asignadas

# roleQualityControlDesc
source: Product status and quality management
es: Gestión de estados y calidad de productos

# roleClientDesc
source: View their projects and products
es: Visualización de sus proyectos y productos

# moduleBatches
source: Batches
es: Lotes

# moduleProducts
source: Products
es: Productos

# moduleProjects
source: Projects
es: Proyectos

# moduleClients
source: Clients
es: Clientes

# moduleCatalog
source: Catalog
es: Catálogo

# modulePhases
source: Phases
es: Fases

# moduleOrganization
source: Organization
es: Organización

# moduleReports
source: Reports
es: Reportes

# actionView
source: View
es: Ver

# actionCreate
source: Create
es: Crear

# actionEdit
source: Edit
es: Editar

# actionDelete
source: Delete
es: Eliminar

# actionMove
source: Move
es: Mover

# actionAssign
source: Assign
es: Asignar

# actionManage
source: Manage
es: Gestionar

# actionExport
source: Export
es: Exportar

# actionGenerate
source: Generate
es: Generar

# scopeAll
source: All
es: Todos

# scopeAssigned
source: Assigned only
es: Solo asignados

# scopeNone
source: None
es: Ninguno

# scopeAllDesc
source: Can view/edit all resources
es: Puede ver/editar todos los recursos

# scopeAssignedDesc
source: Only assigned resources
es: Solo recursos asignados

# scopeNoneDesc
source: No access
es: Sin acceso

source: Product Statuses
es: Estados de Producto

source: Status Management
es: Gestión de Estados

source: Create Status
es: Crear Estado

source: Edit Status
es: Editar Estado

# statusCreated
source: Status created successfully
es: Estado creado correctamente

# statusUpdated
source: Status updated successfully
es: Estado actualizado correctamente

# statusDeleted
source: Status deleted successfully
es: Estado eliminado correctamente

# statusCreateError
source: Error creating status
es: Error al crear estado

# statusDeleteError
source: Error deleting status
es: Error al eliminar estado

# statusPending
source: Pending
es: Pendiente

# statusPendingDesc
source: Product waiting to start production
es: Producto en espera de iniciar producción
